import React from "react";
import RecentNewsCard from "../Components/RecentNewsCard";
import NewsCard from "../Components/NewsCard";
import mainNewsPic from "../Assets/mainNewsPic.png";
import NewsCatagory from "../Components/NewsCatagory";
import facebook from "../Assets/facebook.svg";
import instagram from "../Assets/instagram.svg";
import twitter from "../Assets/twitter.svg";
import copylink from "../Assets/copylink.svg";

export default function NewsDetailsScreen() {
  return (
    <div className="container home__container">
      <div className="home__container__jumbotron">
        <div className="home__container__jumbotron__left">
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
          <RecentNewsCard />
        </div>
        <div className="home__container__jumbotron__right">
          <img
            src={mainNewsPic}
            alt="mainNewsPic"
            className="home__container__jumbotron__img"
          />
          <div className="home__container__jumbotron__content">
            <div className="home__container__jumbotron__content__header">
              <div className="home__container__jumbotron__content__header__btns">
                <button className="home__container__jumbotron__content__header__btn">
                  <img
                    src={facebook}
                    alt="facebook"
                    className="home__container__jumbotron__content__header__btn__img"
                  />
                </button>
                <button className="home__container__jumbotron__content__header__btn">
                  <img
                    src={instagram}
                    alt="facebook"
                    className="home__container__jumbotron__content__header__btn__img"
                  />
                </button>
                <button className="home__container__jumbotron__content__header__btn">
                  <img
                    src={twitter}
                    alt="facebook"
                    className="home__container__jumbotron__content__header__btn__img"
                  />
                </button>
                <button className="home__container__jumbotron__content__header__btn">
                  <img
                    src={copylink}
                    alt="facebook"
                    className="home__container__jumbotron__content__header__btn__img"
                  />
                </button>
              </div>
              <div className="home__container__jumbotron__content__header__heading">
                حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              </div>
            </div>
            <div className="home__container__jumbotron__content__info">
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
              حکومت اور مسلم لیگ (ن) میں شریفوں کے بارے میں برطانیہ کی عدالت
            </div>
          </div>
        </div>
      </div>
      <div className="home__container__trending__catagory">
        <NewsCatagory title="عا لمی خبریں">
          <NewsCard />
          <NewsCard />
          <NewsCard />
          <NewsCard />
        </NewsCatagory>
      </div>
    </div>
  );
}
